## Plan for scanners/owasp-zap
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.scanners-owasp-zap will be created
  + resource "aws_lambda_function" "scanners-owasp-zap" {
      + arn                            = (known after apply)
      + function_name                  = "scanners-owasp-zap"
      + id                             = (known after apply)
      + image_uri                      = "507252742351.dkr.ecr.ca-central-1.amazonaws.com/scan-websites/scanners/owasp-zap:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::507252742351:role/scan-websites-scanners-owasp-zap"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLUSTER"            = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
              + "PRIVATE_SUBNETS"    = "subnet-0c3abcc29d00b8589,subnet-0d16dd34a0f0a4589,subnet-0e48adc704a15a982"
              + "REPORT_DATA_BUCKET" = "scan-websites-owasp-zap-report-data"
              + "SECURITY_GROUP"     = "sg-0711e8c6c24e225c7"
              + "TASK_DEF_ARN"       = "arn:aws:ecs:ca-central-1:507252742351:task-definition/zap_runner:1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0711e8c6c24e225c7",
            ]
          + subnet_ids         = [
              + "subnet-0c3abcc29d00b8589",
              + "subnet-0d16dd34a0f0a4589",
              + "subnet-0e48adc704a15a982",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.scanners-owasp-zap will be created
  + resource "aws_lambda_permission" "scanners-owasp-zap" {
      + action        = "lambda:InvokeFunction"
      + function_name = "scanners-owasp-zap"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
      + statement_id  = "AllowZapRunnerSNSInvoke"
    }

  # aws_sns_topic.owasp-zap-urls will be updated in-place
  ~ resource "aws_sns_topic" "owasp-zap-urls" {
        id                          = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
      ~ kms_master_key_id           = "alias/aws/sns" -> "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
        name                        = "owasp-zap-urls"
        tags                        = {
            "CostCenter" = "scan-websites"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>